<?php
return [
    //引荐载体
    "aa_referral" => [
        10 => [
            "rid" => 10,
            "referral_name" => "官网PC",
            "aa_source" => [
                10010 => "自然流量",
                10020 => "百度推广PC",
            ],
        ],
        11 => [
            "rid" => 11,
            "referral_name" => "官网移动端",
            "aa_source" => [
                11010 => "自然流量",
                11020 => "百度推广移动",
                11030 => "百度信息流",
                11040 => "神马推广",
            ],
        ],
        20 => [
            "rid" => 20,
            "referral_name" => "快商通",
            "aa_source" => [
                20010 => "官网自然流量",
                20020 => "百度推广PC",
                20030 => "百度推广移动",
                20040 => "百度信息流",
                20050 => "神马推广",
            ],
        ],
        30 => [
            "rid" => 30,
            "referral_name" => "400电话",
            "aa_source" => [
                30010 => "官网",
                30020 => "百度推广",
                30030 => "神马推广",
                30040 => "地铁广告",
            ],
        ],
        40 => [
            "rid" => 40,
            "referral_name" => "微信资源",
            "aa_source" => [
                40010 => "软文推广",
                40020 => "公众号",
                40030 => "微课",
            ],
        ],
        50 => [
            "rid" => 50,
            "referral_name" => "我主良缘",
            "aa_source" => [
                50020 => "红娘资源",
                50010 => "业务系统",
            ],
        ],
    ],
];