<?php

return [
    //支付方式
    'paid_method' => [
        1 => '支付宝',
        2 => '微信',
        3 => "银联",
        4 => "银行转账",
    ],
    //客户需求
    'customer_needs' => [
        1 => '线上形象指导',
        2 => '挽回/维护恋情',
        3 => '自我提升/脱单',
        4 => '修复/维护婚姻',
        5 => '其他',
    ],
    //支付
    'paid_for' => [
        1 => '定金',
        2 => '全款',
        3 => "尾款",
        4 => '退款',
    ],
    //审计状态
    'paid_audit_status' => [
        // 10 => "转账截图待审核",
        // 20 => "转账截图已确认",
        // 30 => "无效的转账截图",
        40 => "待审核",
        50 => "审核通过",
        60 => "审核拒绝",
        // 100 => "转账款项已确认",
        // 110 => "转账款项未到账",
    ],
    //订单状态
    "order_status" => [
        10 => "待审核",
        20 => "审核通过",
        30 => "审核拒绝",
        40 => "待审核",
        50 => "审核通过",
        60 => "审核拒绝",
        90 => "订单成功",
        99 => '已删除',
    ],
    "order_status_search" => [
        "10,40" => "待审核",
        "20,50" => "审核通过",
        "30,60" => "审核拒绝",
    ],
    //是否签订合同
    "in_contract" => [
        10 => "未签订合同",
        20 => "已签订合同",
    ],
    //是否开服务
    "in_service" => [
        10 => '未开启',
        20 => '服务中',
    ],
];
