<?php

return [
    'platform' => [
        P_ANGEL=> '魅力天使',

//        P_WZLY => '我主良缘',
//        P_AQQW => '爱情青蛙',
//        P_MLTS => '魅力他说',
//        P_PJ => "派聚",

    ],

    "user_basic_group" => [
        1  => '管理员',
        10 => "团长",
        20 => "分团长",
        30 => "合伙人",
        40 => "成员"
        ],
    "user_status"=>[
        '-1'=>'不通过',
        '0' =>'信息未提交',
        '1' =>'待审核',
        '2' =>'通过'
    ],
    "admin_status"=>[
        '-1' =>'禁用',
        '1' =>'正常',
    ],
    "url" =>''
//        20 => "地域",
//        30 => "省份",
//        40 => "城市",
//        50 => "区域",

//    "user_basic_group" => [
//        1 => '服务系统-管理组',
//
//        10 => "国家",
//        20 => "地域",
//        30 => "省份",
//        40 => "城市",
//        50 => "区域",
//        60 => "门店",
//        70 => "销售总监",
//        75 => "培训经理",
//        80 => "销售经理",
//        90 => "咨询经理",
//        100 => "客服经理",
//        110 => "销售",
//        120 => "咨询师",
//        130 => "客服",
//
//        400 => "派聚总监",
//        410 => "派聚财务",
//        420 => "派聚销售",
//
//        135 => '形象管理总监',
//        140 => '形象顾问',
//
//        200 => "财务经理",
//        210 => "财务人员",
//
//        2000001 => "我主良缘-超级管理员",
//        2000010 => "我主良缘-普通管理员",
//        2000054 => "我主良缘-质检组",
//        2000006 => "我主良缘-客服主管",
//        2000003 => "我主良缘-客服组",
//
//        2000060 => "魅力他说服务顾问",
//        2000061 => "魅力他说管理组",
//    ],
//    "user_status" => [
//        0 => "禁用",
//        1 => "正常",
//    ],
//    "group" => [
//        "status" => [
//            "1" => "已禁用",
//            "2" => "正常",
//        ],
//    ],
//    'login_status' => [
//        '1' => '成功',
//        '2' => '失败',
//    ],
//    'platform' => [
      // P_CSM => '服务系统',
//        P_WZLY => '我主良缘',
//        P_AQQW => '爱情青蛙',
//        P_MLTS => '魅力他说',
//        P_PJ => "派聚",
//    ],
//    'branch_office' => [
//        0 => '全国',
//        53 => "福州",
//        284 => '青岛',
//        197 => '长沙',
//        60 => '厦门',
//        283 => '济南',
//        383 => '杭州',
//        705 => '深圳福田',
//        76 => '广州',
//        220 => '南京',
//        321 => '上海',
//        706 => '深圳罗湖',
//        52 => '北京',
//        1650 => '长沙开福',
//        1651 => '长沙雨花',
//        707 => '深圳南山',
//        3430 => '深圳财富',
//        693 => '广州天河',
//        698 => '广州越秀',
//        3431 => '福二',
//        395 => '香港',
//        696 => '广州海珠',
//        180 => '武汉',
//        322 => '成都',
//        3440 => '重庆一店',
//        3441 => '重庆渝中',
//        2706 => '上海徐汇',
//        2703 => '上海长宁',
//        2710 => '上海静安',
//        2709 => '上海普陀',
//        2713 => '上海黄浦',
//        1546 => '武汉一店',
//        3434 => '深圳岗厦',
//        3435 => '深圳国贸',
//        221 => '苏州',
//        3436 => '广州耀中',
//        3437 => '杭州一店',
//        3438 => '杭州二店',
//        233 => '南昌',
//        97 => '南宁',
//        3442 => '广州耀中(新)',
//    ],
];
