<?php
/**
 * 我主良缘CRM相关配置
 */
//优先级降序
return [
    "roles" => [
        "1", //超级管理员
        "10", //"普通管理员"=总监
        '54', //质检组
        "6", //客服主管
        "3", //"客服组",

        "61", //魅力他说管理组
        "60", //魅力他说服务顾问
    ],

    //魅力他说门店
    'mlts_branches' => [
        "40053" => "福州魅力他说",
        "40077" => "深圳魅力他说",
        "30076" => "广州爱情青蛙",
    ],
    //爱情青蛙门店
    'aqqw_branches' => [
        "30076" => "广州爱情青蛙",
    ],
    'branch_in_city' => [
        //深圳
        '705' => 77,
        '707' => 77,
        '706' => 77,
        '3430' => 77,
        '3434' => 77,
        '3435' => 77,

        //广州
        '693' => 76,
        '698' => 76,
        '696' => 76,
        '3436' => 76,
        '3442' => 76,

        //长沙
        '1650' => 197,
        '1651' => 197,

        //上海
        '2706' => 321,
        '2703' => 321,
        '2710' => 321,
        '2709' => 321,
        '2713' => 321,
        '3461' => 321,

        // 杭州
        '3437' => 383,
        '3438' => 383,

        // 重庆
        '3440' => 394,
        '3441' => 394,

        // 武汉
        '1546' => 180,

        // 合肥
        '3443' => 3401,

        // 郑州
        '3444' => 149,
    ],

    //旧有配置
    // ,1545=>'武汉武昌' 删除 武汉武昌 , 3433 => '普陀电销', 3439 => '红本本上海'
    'branch_id' => [0 => '全国',
        // 53 => "福州",
        3452 => '福州一店',
        // 284 => '青岛',
        3454 => '青岛一店',
        197 => '长沙',
        // 60 => '厦门',
        3453 => '厦门一店',
        // 283 => '济南',
        3456 => '济南一店',
        383 => '杭州', 77 => '深圳', 705 => '深圳福田', 76 => '广州',
        // 220 => '南京',
        3457 => '南京一店',
        321 => '上海', 706 => '深圳罗湖',
        // 52 => '北京',
        3451 => '北京一店', 6102 => '北京二店',
        1650 => '长沙开福', 1651 => '长沙雨花', 707 => '深圳南山', 3430 => '深圳财富', 693 => '广州天河', 698 => '广州越秀', 3431 => '福二',
        // 395 => '香港',
        3460 => '香港一店',
        696 => '广州海珠', 180 => '武汉', 322 => '成都', 3445 => '成都一店', 3446 => '成都二店', 3440 => '重庆一店', 3441 => '重庆渝中', 2706 => '上海徐汇', 2703 => '上海长宁', 2710 => '上海静安', 2709 => '上海普陀', 2713 => '上海黄浦', 1546 => '武汉一店', 3434 => '深圳岗厦', 3435 => '深圳国贸',
        // 221 => '苏州',
        3455 => '苏州一店',
        3436 => '广州耀中', 3437 => '杭州一店', 3438 => '杭州二店',
        // 233 => '南昌',
        3458 => '南昌一店',
        // 97 => '南宁',
        3459 => '南宁一店',
        3442 => '广州耀中(新)', 3401 => '合肥', 3443 => '合肥之心城', 149 => '郑州', 3444 => '郑州金水', 3447 => '重庆江北',
        3448 => '佛山百花', 3449 => '珠海光大', 3450 => '成都富力', 3461 => '上海约会吧', 3462 => '昆明宝善', 3463 => '武汉汉街',

        //test
        9999 => '测试门店',
        6100 => '石家庄燕华',
        6101 => '天津大都会',
        6104 => '东莞南城',
    ],

    // ,1545=>'武汉武昌' 删除 武汉武昌 , 3433 => '普陀电销', 3439 => '红本本上海'
    'branch_ids' => [0 => '全国',
        // 53 => "福州",
        3452 => '福州一店',
        // 284 => '青岛',
        3454 => '青岛一店',
        197 => '长沙',
        // 60 => '厦门',
        3453 => '厦门一店',
        // 283 => '济南',
        3456 => '济南一店',
        383 => '杭州', 705 => '深圳福田', 76 => '广州',
        // 220 => '南京',
        3457 => '南京一店',
        321 => '上海', 706 => '深圳罗湖',
        // 52 => '北京',
        3451 => '北京一店', 6102 => '北京二店',
        77 => '深圳', 1650 => '长沙开福', 1651 => '长沙雨花', 707 => '深圳南山', 3430 => '深圳财富', 693 => '广州天河', 698 => '广州越秀', 3431 => '福二',
        // 395 => '香港',
        3460 => '香港一店',
        696 => '广州海珠', 180 => '武汉', 322 => '成都', 3445 => '成都一店', 3446 => '成都二店', 3440 => '重庆一店', 3441 => '重庆渝中', 2706 => '上海徐汇', 2703 => '上海长宁', 2710 => '上海静安', 2709 => '上海普陀', 2713 => '上海黄浦', 1546 => '武汉一店', 3434 => '深圳岗厦', 3435 => '深圳国贸',
        // 221 => '苏州',
        3455 => '苏州一店',
        3436 => '广州耀中', 3437 => '杭州一店', 3438 => '杭州二店',
        // 233 => '南昌',
        3458 => '南昌一店',
        // 97 => '南宁',
        3459 => '南宁一店',
        3442 => '广州耀中(新)', 3401 => '合肥', 3443 => '合肥之心城', 149 => '郑州', 3444 => '郑州金水', 3447 => '重庆江北',
        3448 => '佛山百花', 3449 => '珠海光大', 3450 => '成都富力', 3461 => '上海约会吧', 3462 => '昆明宝善', 3463 => '武汉汉街',
        //test
        9999 => '测试门店',
        6100 => '石家庄燕华',
        6101 => '天津大都会',
        6104 => '东莞南城',
    ],
    //加盟商
    'franchise_branches' => [
        3443 => '合肥之心城', 3444 => '郑州金水', 3447 => '重庆江北',
        3448 => '佛山百花', 3449 => '珠海光大', 3450 => '成都富力', 3462 => '昆明宝善', 3463 => '武汉汉街',
        6100 => '石家庄燕华', 6101 => '天津大都会', 6104 => '东莞南城',
    ],
    // , 3439 => 'hbb_sh'
    'branch_key' => [0 => 'www', 53 => "fz", 284 => 'qd', 197 => 'cs', 60 => 'xm', 283 => 'jn', 383 => 'hz', 705 => 'szft', 76 => 'gz', 220 => 'nj', 321 => 'sh', 706 => 'szlh', 52 => 'bj', 77 => 'sz', 3430 => 'szft2', 693 => 'gzth', 698 => 'gzyx', 696 => 'gzhz', 2706 => 'shxh', 2703 => 'shcn', 2710 => 'shja', 395 => 'xg', 2709 => 'shpt', 2713 => 'shhp', 3433 => 'ptdx', 1545 => 'whwc', 1546 => 'whjh', 3434 => 'szgx', 3435 => 'szgm', 221 => 'jssz', 3436 => 'gzyz', 3437 => 'hz1d', 3438 => 'hz2d', 233 => 'nc', 97 => 'gxnn'],

    'city_branch' => [
        '77' => [705, 707, 706, 3430, 3434, 3435], // 深圳
        '76' => [693, 698, 696, 3436, 3442], // 广州
        '197' => [1650, 1651], // 长沙
        '321' => [2706, 2703, 2710, 2709, 2713, 3461], // 上海
        '383' => [3437, 3438], // 杭州
        '394' => [3440, 3441], // 重庆
        '180' => [1546], // 武汉
        '3401' => [3443], // 合肥
        '149' => [3444], // 郑州
    ],

    'MEMBER_IMAGE_UPLOAD_PATH_R' => '__ROOT__/upload/Avatar/Big/',
    'MEMBER_IMAGE_UPLOAD_PATH' => '/upload/Avatar/Big/',
    'MEMBERS_IMAGE_UPLOAD_PATH' => 'upload/Avatar/Big/',
    'MEMBERS_IMAGE_UPLOAD_PATH_S' => 'upload/Avatar/Small/',
    'MEMBERS_IMAGE_UPLOAD_PATH_O' => 'upload/Avatar/Origin/',
    'MEMBER_SAMLL_UPLOAD_PATH_R' => '__ROOT__/upload/Avatar/Small/',
    'MEMBER_IMAGE_UPLOAD_PATH_R_O' => '__ROOT__/upload/Avatar/Origin/',
    'if_id' => [1 => '是', 2 => '否'],
    'sex_id' => [1 => '女', 2 => '男'],
    'status_id' => [0 => '正常', 1 => '回收', 2 => '封存'],
    'net_status_id' => [0 => '正常', 1 => '黑名单'],
    'top_id' => [0 => '正常', 1 => '置顶'],
    'act_status_id' => [0 => '显示', 1 => '屏蔽'],
    'birthyear_id' => [1940 => '1940', 1941 => '1941', 1942 => '1942', 1943 => '1943', 1944 => '1944', 1945 => '1945', 1946 => '1946', 1947 => '1947', 1948 => '1948', 1949 => '1949', 1950 => '1950', 1951 => '1951', 1952 => '1952', 1953 => '1953', 1954 => '1954', 1955 => '1955', 1956 => '1956', 1957 => '1957', 1958 => '1958', 1959 => '1959', 1960 => '1960', 1961 => '1961', 1962 => '1962', 1963 => '1963', 1964 => '1964', 1965 => '1965', 1966 => '1966', 1967 => '1967', 1968 => '1968', 1969 => '1969', 1970 => '1970', 1971 => '1971', 1972 => '1972', 1973 => '1973', 1974 => '1974', 1975 => '1975', 1976 => '1976', 1977 => '1977', 1978 => '1978', 1979 => '1979', 1980 => '1980', 1981 => '1981', 1982 => '1982', 1983 => '1983', 1984 => '1984', 1985 => '1985', 1986 => '1986', 1987 => '1987', 1988 => '1988', 1989 => '1989', 1990 => '1990', 1991 => '1991', 1992 => '1992', 1993 => '1993', 1994 => '1994', 1995 => '1995', 1996 => '1996', 1997 => '1997', '1998' => '1998', '1999' => '1999'],
    'birthmonth_id' => [1 => 1, 2 => 2, 3 => 3, 4 => 4, 5 => 5, 6 => 6, 7 => 7, 8 => 8, 9 => 9, 10 => 10, 11 => 11, 12 => 12],
    'birthday_id' => [1 => 1, 2 => 2, 3 => 3, 4 => 4, 5 => 5, 6 => 6, 7 => 7, 8 => 8, 9 => 9, 10 => 10, 11 => 11, 12 => 12, 13 => 13, 14 => 14, 15 => 15, 16 => 16, 17 => 17, 18 => 18, 19 => 19, 20 => 20, 21 => 21, 22 => 22, 23 => 23, 24 => 24, 25 => 25, 26 => 26, 27 => 27, 28 => 28, 29 => 29, 30 => 30, 31 => 31],
    'marrige_id' => [1 => '未婚', 3 => '离异', 4 => '丧偶'],
    'childrens_id' => [1 => '无小孩', 2 => '有小孩', 3 => '有小孩跟自己', 4 => '有小孩不跟自己'],
    'unit_type_id' => [1 => '政府机关', 2 => '事业单位', 3 => '外企企业', 4 => '世界500强', 5 => '上市公司', 6 => '国有企业', 7 => '私营企业', 8 => '自有公司', 9 => '私营个体', 10 => '部队军职', 11 => '民营企业', 12 => '台资企业'],
    'education_id' => [8 => '初中', 9 => '高中', 10 => '中专', 20 => '大专', 30 => '本科', 40 => '硕士', 50 => '博士', 60 => '双学位'],
    'salary_id' => [1 => "2000以下", 3 => "2000-3000元", 4 => "3000-4000元", 5 => "4000-5000元", 6 => "5000-8000元", 7 => "8000-10000元", 8 => "10000-20000元", 11 => "20000-30000元", 12 => "30000-40000元", 13 => "40000-50000元", 9 => "50000-100000元", 10 => "100000元以上"],
    'personality_id' => [1 => '外向', 2 => '内敛', 3 => '中性'],
    'car_id' => [1 => '暂未购车', 2 => '已经购车', 3 => '准备购车', 4 => '未填'],
    'housing_id' => [1 => '暂未购房', 2 => '已购住房', 8 => '多套住房', 3 => '与人合租', 4 => '独自租房', 5 => '父母有房', 6 => '住亲朋家', 7 => '住单位房', 9 => '有购房能力', 10 => '未填', 11 => '居屋', 12 => '公屋'],
    'source_id' => [5 => '百度搜索', 6 => '公司网站', 7 => '电视台', 9 => '朋友介绍', 10 => '会员介绍', 15 => '公司现场活动', 21 => '网络推广', 29 => '', 22 => '微信营销', 23 => '微博营销', 4 => '巴士广播', 28 => 'QQ', 30 => '', 31 => '团购活动', 32 => '外联资源', 33 => '新媒体资源', 40 => '今日头条', 46 => '腾讯新闻', 47 => '公交车广告', 48 => '分众视频', 49 => '分众框架', 50 => '品友DSP', 53 => '报纸地推', 62 => '地铁视频'],
    'source_pro' => ['fz' => [1 => '海峡都市报', 2 => '东南快报', 3 => '福州晚报', 8 => '左海之声'], 'cs' => [11 => '潇湘晨报', 12 => '长沙晚报', 13 => '潇湘晨报96360', 25 => '长沙晚报96333', 14 => '长沙移动电视'], 'xm' => [16 => '厦门导报', 17 => '厦门晚报', 18 => '小鱼网'], 'jn' => [19 => '生活日报', 20 => '齐鲁晚报', 45 => '都市女报'], 'qd' => [26 => '青岛早报', 27 => '青岛晚报', 34 => '半岛都市报'], 'hz' => [39 => '钱江晚报', 35 => '杭州城报', 42 => '都市快报'], 'sz' => [36 => '深圳地铁报', 37 => '深圳晚报', 38 => '南方都市报', 43 => '深圳地铁视频', 44 => '深圳都市频道'], 'gz' => [41 => '羊城地铁报'], 'nj' => [63 => '东方卫报', 72 => '现代快报'], 'xg' => [79 => '香港东铁', 80 => '香港苹果报纸']],
    'source_id_ext' => [5 => '百度搜索', 6 => '公司网站', 7 => '电视台', 9 => '朋友介绍', 10 => '会员介绍', 15 => '公司现场活动', 21 => '网络推广', 29 => '', 22 => '微信营销', 23 => '微博营销', 4 => '巴士广播', 28 => 'QQ', 30 => '', 1 => '海峡都市报', 2 => '东南快报', 3 => '福州晚报', 8 => '左海之声', 11 => '潇湘晨报', 12 => '长沙晚报', 13 => '潇湘晨报96360', 25 => '长沙晚报96333', 14 => '长沙移动电视', 16 => '厦门导报', 17 => '厦门晚报', 18 => '小鱼网', 19 => '生活日报', 20 => '齐鲁晚报', 26 => '青岛早报', 27 => '青岛晚报', 32 => '外联资源', 33 => '新媒体资源', 34 => '半岛都市报', 35 => '杭州城报', 36 => '深圳地铁报', 37 => '深圳晚报', 38 => '南方都市报', 39 => '钱江晚报', 40 => '今日头条', 41 => '羊城地铁报', 42 => '都市快报', 43 => '深圳地铁视频', 44 => '深圳都市频道', 45 => '都市女报', 46 => '腾讯新闻', 47 => '公交车广告', 48 => '分众视频', 49 => '分众框架', 50 => '品友DSP', 62 => '地铁视频'],
    //'stage_id'=>array(0=>'公库',1=>'A库',2=>'B库',3=>'C库',4=>'D库',5=>'E库'),
    //'stage_arr'=>array(1=>array(3000,5),2=>array(300,15),3=>array(200,50),4=>array(80,180),5=>array(20,360)),
    'stage_id' => [0 => '公库', 1 => '未联系', 2 => '未到店', 5 => '预约到店', 3 => '已到店', 4 => '重点跟进'],
    'stage_arr' => [1 => 40, 2 => 60, 3 => 50, 4 => 30],
    'stage_num' => [0 => 150, 1651 => 120],
    'stage_arr_1651' => [1 => 20, 2 => 20, 3 => 30, 4 => 30],

    // 电销相关配置
    'dx_stage_id' => [0 => '公库', 1 => '未联系', 2 => '未预约', 5 => '预约到店'],
    'dx_stage_arr' => [1 => 40, 2 => 60],
    'dx_stage_num' => [0 => 100],

    'public_limit' => '15',
    'member_tag_id' => [1 => '参加过活动', 2 => '帅哥', 3 => '身材高挑', 4 => '气质佳', 5 => '会打扮', 6 => '谈吐有致', 7 => '素质高'],
    'customer_tag_id' => [1 => '参加过活动', 2 => '意向强', 3 => '外在条件好', 4 => '家庭背景好', 5 => '个人资产多', 6 => '购买力强'],
    'gears_id' => [8 => '准会员', 2 => "阳光会员", 6 => "高级会员", 3 => "白金会员", 4 => "钻石会员", 7 => "单身俱乐部", 9 => "至尊会员", 10 => "爱情定制", 11 => "天作之合", 12 => "天长地久"],
    'gear_id' => [1 => "优才会员", 5 => "活动会员", 7 => "建档会员", 10 => "阳光会员", 20 => "高级会员", 25 => "水晶会员", 26 => '普通会员', 30 => "白金会员", 35 => '翡翠会员', 40 => "钻石会员", 50 => "爱情定制", 60 => "至尊会员", 70 => "天长地久", 80 => "天作之合", 90 => "锦绣人生",
        "1200" => "强婚恋-幸福人生",
        "1300" => "强婚恋-精致人生",
        "1400" => "强婚恋-非凡人生",
        "1500" => "强婚恋-卓越人生",
        "1600" => "强婚恋-尊享人生",
        "1700" => "强婚恋-精彩人生",
        "2100" => "强婚恋-知己能力套餐",
        "2200" => "强婚恋-知彼能力套餐",
        "2300" => "强婚恋-连接能力套餐",
        "2400" => "强婚恋-关系推进能力套餐",
        "2500" => "强婚恋-解决问题套餐",
        "2600" => "强婚恋-情感挽回/婚姻修复套餐",
        "2700" => "强婚恋-变美能力套餐",
        "5100" => "魅力他说套餐",
        "6100" => "爱情青蛙套餐",
        "7100" => "派聚套餐",
    ],
    'server_version' => [
        1 => '心动24小时经典版',
        2 => '心动48小时经典版',
        3 => '心动48小时严选版',
    ],
    'qianghunlian' => [
        //"1200",
        "1300",
        "1400",
        "1500",
        "1600",
        "1700",
        "2100",
        "2200",
        "2300",
        "2400",
        "2500",
        "2600",
        "2700",
    ],
    'attire_id' => [1 => '穿戴名牌', 2 => '穿着得体', 3 => '着装一般', 4 => '着装不协调'],
    'speech_id' => [1 => '能言善辩', 2 => '表达一般', 3 => '不善言辞'],
    'quality_id' => [1 => '有格局有气场', 2 => '素质高雅', 3 => '素质良好', 4 => '素质一般', 5 => '素质较差'],
    'matrimonial_id' => [1 => '从未接触', 2 => '比较了解', 3 => '做过会员', 4 => '有不悦经历'],
    'dating_id' => [0 => '没有', 1 => '一次', 2 => '两次', 3 => '三次', 4 => '四次', 5 => '五次', 6 => '十次以上'],
    'love_id' => [0 => '没有', 1 => '一次', 2 => '两次', 3 => '三次', 4 => '四次', 5 => '五次以上'],
    'emotional_id' => [1 => '恋爱心态良好', 2 => '情感经历正常', 3 => '受过创伤已恢复', 4 => '受过创伤未恢复', 5 => '尚未走出前段感情', 6 => '对婚姻失去信心'],
    'interview_id' => [1 => '十五分钟', 2 => '三十分钟', 3 => '四十五分钟', 4 => '一小时及以上'],
    'talk_id' => [1 => '三分钟内', 2 => '五分钟', 3 => '十分钟', 4 => '十五分钟', 5 => '二十分钟', 6 => '半小时及以上'],
    'follow_time' => [3 => '3分钟', 5 => '5分钟', 10 => '10分钟', 15 => '15分钟', 20 => '20分钟', 30 => '30分钟', 45 => '45分钟', 60 => '60分钟以上'],
    'character_id' => [1 => '偏急', 2 => '急躁', 3 => '正常', 4 => '良好', 5 => '温和', 6 => '忧郁', 7 => '善变', 8 => '矛盾体', 9 => '纠结', 10 => '有主见', 11 => '无主见'],
    'price_id' => [1 => '完全价格原因', 2 => '主要价格原因', 3 => '部分价格原因', 4 => '无价格顾虑'],
    'payment_id' => [1 => '自己有消费能力', 2 => '需要家人付款', 3 => '自己需要分期、等发工资'],
    'family_id' => [1 => '需与家人协商', 2 => '担心子女不同意', 3 => '父亲较反对', 4 => '母亲较反对'],
    'brand_id' => [1 => '担心资源不够', 2 => '担心成功率', 3 => '担心交钱不服务', 4 => '担心受骗', 5 => '担心与承诺不符'],
    'intention_id' => [1 => '已定入会时间', 2 => '已付定金', 3 => '已口头承诺入会', 4 => '有一定意向', 5 => '需再次跟踪', 6 => '暂无意向'],
    'follow_type_id' => [1 => '电话', 2 => '面谈', 3 => '网聊'],
    'plan_type_id' => [1 => '电话', 2 => '面谈'],
    'mate_area_ids' => [0 => '不限', 1 => "福州市区", 2 => "福州八县", 6 => "五区八县", 3 => "福建本省", 7 => "青岛七区", 8 => "青岛两市", 9 => "山东本省", 10 => "长沙五区", 11 => "长沙三县", 12 => "湖南本省", 13 => "济南本市", 14 => "济南周边地区", 15 => "浙江本省", 16 => "杭州本市", 17 => "广东本省", 18 => "深圳本市", 19 => "上海市"],
    'mate_marrige_ids' => [0 => '不限', 1 => '未婚', 3 => '离异', 4 => '丧偶'],
    'mate_childrens_ids' => [0 => '不限', 1 => '无小孩', 2 => '有小孩跟自己', 3 => '有小孩不跟自己'],
    'mate_unit_type_ids' => [0 => '不限', 1 => '政府机关', 2 => '事业单位', 3 => '外企企业', 4 => '世界500强', 5 => '上市公司', 6 => '国有企业', 7 => '私营企业', 8 => '自有公司', 9 => '私营个体', 10 => '部队军职', 11 => '民营企业', 12 => '台资企业'],
    'mate_education_id' => [0 => '不限', 8 => '初中', 9 => '高中', 10 => '中专', 20 => '大专', 30 => '本科', 40 => '硕士', 50 => '博士', 60 => '双学位'],
    'mate_car_ids' => [0 => '不限', 1 => '暂未购车', 2 => '已经购车', 3 => '准备购车'],
    'mate_housing_ids' => [0 => '不限', 1 => '暂未购房', 2 => '已购住房', 8 => '多套住房', 3 => '与人合租', 4 => '独自租房', 5 => '与父母同住', 6 => '住亲朋家', 7 => '住单位房', 9 => '有购房能力'],
    'mate_religious_ids' => [0 => '不限', 1 => "无宗教信仰", 2 => "佛教", 3 => "道教", 4 => "儒教", 5 => "基督教", 6 => "伊斯兰教", 7 => "其它宗教信仰", 0 => "不限"],
    'mate_appearance_ids' => [0 => '不限', 1 => '普通', 2 => '良好', 3 => '出众', 4 => '非常好'],
    'mate_personality_ids' => [0 => "不限", 13 => "外向", 14 => "内敛", 15 => "中性"],
    'limit_months' => [1 => 1, 2 => 2, 3 => 3, 4 => 4, 5 => 5, 6 => 6, 7 => 7, 8 => 8, 9 => 9, 10 => 10, 11 => 11, 12 => 12],
    'tmp_limit_months' => [1 => 1, 2 => 2, 3 => 3, 4 => 4, 5 => 5, 6 => 6, 7 => 7, 8 => 8, 9 => 9, 10 => 10, 11 => 11, 12 => 12,
        18 => 18, 24 => 24, 36 => 36,
    ],
    'type_id' => [1 => '准客户', 2 => '会员', 3 => '网络资源', 4 => '推荐号', 5 => '外联资源', 6 => '新媒体资源', 7 => '网站资源-wzly', 8 => '网站资源-hbb', 10 => '新客户资源'],
    'degree_id' => [1 => '投诉紧急', 2 => '特急', 3 => '急', 4 => '一般'],
    'arrange_stage_id' => [1 => '待见面', 2 => '见面完成', 3 => '见面取消'],
    'feeling_id' => [1 => '很喜欢，愿意交往', 2 => '满意，想接触看看', 3 => '一般般', 4 => '不满意'],
    'service_stage_id' => [1 => "待安排", 2 => "待见面", 3 => "接触中", 4 => "心里督导", 5 => "恋爱中", 6 => "已结婚", 7 => "已暂停", 8 => "已结束"],
    'service_status_id' => [1 => '新会员', 2 => '正常会员', 3 => '即将过期会员', 4 => '已过期会员'],
    'task_type_id' => [1 => '客户冲突', 2 => '客户到期', 3 => '待安排', 4 => '待见面', 5 => '见面回访', 6 => '见面二次回访', 7 => '恋爱回访', 8 => '结婚回访', 9 => '跟进计划'],
    'agency_id' => [1 => '本人办理', 2 => '父亲代办', 3 => '母亲代办', 4 => '其他亲人朋友代办'],
    'art_class_id' => [1 => '公司公告', 2 => '公司视频'],
    'arrangement_grouping' => ['today' => '今日需约会', 'overdue' => '过期未回访', 'willdo' => '待约会', 'do' => '已约会', 'cancle' => '已取消', 'all' => '所有'],
    'plan_grouping' => ['today' => '今日需执行', 'overdue' => '过期未执行', 'willdo' => '待执行', 'do' => '已执行', 'all' => '所有'],
    'service_grouping' => ['normal' => '正式会员', 'free' => '优才会员', 'new' => '新会员', 'willexpire' => '即将过期会员', 'expired' => '已过期会员', 'all' => '所有会员'],
    'net_source_id' => ['J' => 'J', 'Q' => 'Q', 'W' => 'W', 'M' => 'M', 'B' => 'B', 'Z' => 'Z', 'G' => 'G', 'Y' => 'Y', 'O' => 'O'],
    'net_grouping' => ['all' => '所有', 'undistributed' => '未分配', 'distributed' => '已分配', 'initiation' => '已入会'],
    'rec_grouping' => ['all' => '所有', 'undistributed' => '未交号', 'distributed' => '已交号', 'initiation' => '已入会'],
    'xmt_source_id' => [1 => '微信公众号', 2 => '活动行', 3 => '互动吧', 4 => '商桥', 5 => '论坛', 6 => 'qq', 9 => '短信', 8 => '其他', 11 => '网站注册', 12 => '今日头条', 13 => '腾讯新闻', 14 => '新浪新闻', 15 => '羊城地铁报', 17 => '深圳地铁报', 26 => '深圳都市报', 21 => '深圳晚报', 30 => '深圳都市频道', 31 => '深圳晶报', 32 => '青岛早报', 33 => '青岛晚报', 34 => '半岛都市报', 23 => '都市快报', 24 => '钱江晚报', 25 => '杭州城报', 27 => '海都报', 28 => '厦门导报', 29 => '厦门晚报', 18 => '广点通', 19 => '搜狐', 20 => '陌陌', 16 => '报纸', 22 => '智慧推', 35 => '长沙晚报', 36 => 'UC浏览器', 37 => '一点资讯', 38 => '新浪微博', 50 => '品友DSP', 51 => '生活日报', 52 => 'ZAKER', 53 => '报纸地推', 55 => '都市女报', 56 => '粉丝通', 13 => '腾讯新闻', 1 => '微信公众号', 52 => 'ZAKER', 54 => '朋友圈营销', 57 => '爱奇艺', 58 => 'hao123', 47 => '公交车广告', 59 => '北京晚报', 60 => '百度dsp', 61 => '新京报', 62 => '地铁视频', 63 => '东方卫报', 64 => '分众电梯', 65 => '美柚经期', 66 => '凤凰新闻', 68 => '网易新闻', 69 => 'wifi万能钥匙', 70 => 'oppo信息流', 71 => '新闻晨报', 72 => '现代快报', 73 => '大v推广', 74 => '花生wifi', 75 => '优酷', 76 => '武汉晨报', 77 => '新城快报', 78 => '趣头条', 79 => '香港东铁', 80 => '香港苹果报纸', 81 => '上海劳动报', 82 => '新民晚报', 83 => '58同城', 84 => 'Facebook', 85 => 'instagram', 86 => 'google', 87 => 'yahoo', 88 => 'youtube', 89 => 'MeetUp', 90 => '香港單身活動', 91 => '香港地鐵', 92 => '香港報紙/雜誌', 93 => '香港朋友介紹', 94 => '香港其他', 95 => '讯飞输入法', 96 => 'VIVO手机', 97 => '美图秀秀', 98 => '秒拍', 99 => '知乎', 100 => '重庆热报', 115 => '微信平台推广'],
    'purpose_id' => [10 => 'A类', 11 => 'B类', 12 => 'C类', 13 => 'D类', 14 => 'F类', 15 => 'G类', 16 => 'H类', 17 => 'I 类', 18 => 'K类', 19 => 'L类', 1 => '1 类', 2 => '2 类', 3 => '3 类', 4 => '4 类'],
    'purpose_text' => [
        10 => '未接通，待跟进',
        11 => '需求明确，初步沟通，需跟进',
        12 => '需求明确，介绍服务，需跟进',
        13 => '意向会员 待确认到店时间',
        14 => '确认到店时间 控单客户',
        15 => '已到店，需二邀确认意向',
        16 => '一周内可以再次到店',
        17 => '已到店，有异议需培养跟进',
        18 => '确定购买，确认支付时间',
        19 => '已支付定金会员',
        1 => '(不推荐使用)',
        2 => '(不推荐使用)',
        3 => '(不推荐使用)',
        4 => '(不推荐使用)',
    ],
    'abandon_id' => [],
    'pagesize_id' => [1 => '二分之一', 2 => '四分之一', 3 => '整版', 4 => '八分之一', 5 => '无版面'],
    //'newspaper_ids'=>array(1=>'海峡都市报',2=>'厦门晚报',3=>'海峡导报',4=>'深圳都市报',5=>'南方都市报',6=>'深圳晚报',7=>'青岛早报',8=>'青岛晚报',9=>'杭州城报',10=>'今日早报',11=>'钱江晚报',12=>'长沙晚报',13=>'潇湘晨报',14=>'生活日报',15=>'齐鲁晚报',16=>'山东商报',17=>'半岛都市报',18=>'都市女报'),
    'newspaper_ids' => [15 => '羊城地铁报', 17 => '深圳地铁报', 26 => '深圳都市报', 21 => '深圳晚报', 30 => '深圳都市频道', 31 => '深圳晶报', 32 => '青岛早报', 33 => '青岛晚报', 34 => '半岛都市报', 23 => '都市快报', 24 => '钱江晚报', 25 => '杭州城报', 27 => '海都报', 28 => '厦门导报', 29 => '厦门晚报', 35 => '长沙晚报', 51 => '生活日报', 12 => '今日头条', 1 => '微信公众号', 52 => 'ZAKER', 54 => '朋友圈营销', 3 => '互动吧', 55 => '都市女报', 56 => '粉丝通', 13 => '腾讯新闻', 59 => '北京晚报', 61 => '新京报', 63 => '东方卫报', 38 => '新浪微博', 66 => '报纸外推', 71 => '新闻晨报', 72 => '现代快报', 73 => '大v推广', 74 => '花生wifi', 68 => '网易新闻', 75 => '优酷', 76 => '武汉晨报', 77 => '新城快报', 81 => '上海劳动报', 82 => '新民晚报', 83 => '58同城', 84 => 'Facebook', 85 => 'instagram', 86 => 'google', 87 => 'yahoo', 88 => 'youtube', 89 => 'MeetUp', 90 => '香港單身活動', 91 => '香港地鐵', 92 => '香港報紙/雜誌', 93 => '香港朋友介紹', 94 => '香港其他', 95 => '讯飞输入法', 100 => '重庆热报', 115 => '微信平台推广'],

    'week_id' => [1 => '星期一', 2 => '星期二', 3 => '星期三', 4 => '星期四', 5 => '星期五', 6 => '星期六', 7 => '星期天'],
    'remind_grouping' => ['today' => '今日提醒', 'willdo' => '待提醒', 'do' => '已提醒', 'all' => '所有'],
    'sms_type_id' => [1 => '新资源预约短信', 2 => '首次未接电话的新资源', 3 => '一直未接听的新资源', 3 => '沟通一半中断的会员', 4 => '首次电话邀约之后的短信', 5 => '日常关心/维护热度的短信', 6 => '预约短信', 7 => '给会员的情感短信', 8 => '给大龄女准会员的短信', 9 => '坦诚沟通短信', 10 => '温馨提醒类短信', 11 => '客服部找优男或佳丽短信'],
    'enroll_grouping' => ['all' => '所有', 'new' => '新增', 'unprotect' => '未保护', 'protect' => '保护中', 'initiation' => '已入会'],
    'news_type_id' => [10 => '微信相亲会', 20 => '约见', 30 => '交友社区', 40 => '微信群', 50 => 'QQ群', 60 => '官网咨询窗口', 70 => '线上其他', 80 => '现场活动', 90 => '填写缘分卡', 100 => '线下其他'],
    'unit_stage_id' => [1 => '未合作', 2 => '洽谈中', 3 => '已合作'],
    'site_source_id' => ['bd' => '百度pc', 'bdmbn' => '百度yd', 'bddsp' => '百度dsp', '360' => '360', 'sg' => '搜狗pc', 'sgmbn' => '搜狗yd', '360mbn' => '手机360竞价新', 'gg' => '谷歌pc', 'ggmbn' => '谷歌yd', 'by' => '必应pc', 'bymbn' => '必应yd', 'sm' => '神马', 'qqauth' => 'QQ授权', '360' => '360', 'sinaauth' => '新浪授权', 'wechatauth' => '微信授权', 'toutiao' => '头条', 'wzlywap' => '移动端', 'wzlyjy' => 'PC', 'ios' => 'iOS', 'android' => 'Android', 'mb_bm' => '移动报名', '2345' => '2345', '58' => '58', 'nmmbn' => '百度糯米'],
    'appid' => [53 => '046', 60 => '829'],

    // 开店的城市和城市代码
    // 提供给imsAction/citys 列出城市id
    'city_code' => [
        52 => ['name' => '北京', 'code' => '010'],
        3451 => ['name' => '北京一店', 'code' => '010'],

        53 => ['name' => '福州', 'code' => '0591'],
        3452 => ['name' => '福州一店', 'code' => '0591'],

        284 => ['name' => '青岛', 'code' => '0532'],
        3454 => ['name' => '青岛一店', 'code' => '0532'],

        60 => ['name' => '厦门', 'code' => '0592'],
        3453 => ['name' => '厦门一店', 'code' => '0592'],

        221 => ['name' => '苏州', 'code' => '0512'],
        3455 => ['name' => '苏州一店', 'code' => '0512'],

        283 => ['name' => '济南', 'code' => '0531'],
        3456 => ['name' => '济南一店', 'code' => '0531'],

        220 => ['name' => '南京', 'code' => '025'],
        3457 => ['name' => '南京一店', 'code' => '025'],

        395 => ['name' => '香港', 'code' => '852'],
        3460 => ['name' => '香港一店', 'code' => '852'],

        233 => ['name' => '南昌', 'code' => '0791'],
        3458 => ['name' => '南昌一店', 'code' => '0791'],

        97 => ['name' => '南宁', 'code' => '0771'],
        3459 => ['name' => '南宁一店', 'code' => '0771'],

        394 => ['name' => '重庆', 'code' => '023'],
        3340 => ['name' => '重庆一店', 'code' => '023'],
        3341 => ['name' => '重庆渝中', 'code' => '023'],
        3447 => ['name' => '重庆江北', 'code' => '023'],

        197 => ['name' => '长沙', 'code' => '0731'],
        1650 => ['name' => '长沙开福', 'code' => '0731'],
        1651 => ['name' => '长沙雨花', 'code' => '0731'],

        383 => ['name' => '杭州', 'code' => '0571'],
        3437 => ['name' => '杭州一店', 'code' => '0571'],
        3438 => ['name' => '杭州二店', 'code' => '0571'],

        77 => ['name' => '深圳', 'code' => '0755'],
        705 => ['name' => '深圳福田', 'code' => '0755'],
        706 => ['name' => '深圳罗湖', 'code' => '0755'],
        707 => ['name' => '深圳南山', 'code' => '0755'],
        3430 => ['name' => '深圳财富', 'code' => '0755'],
        3434 => ['name' => '深圳岗厦', 'code' => '0755'],
        3435 => ['name' => '深圳国贸', 'code' => '0755'],
        3431 => ['name' => '福二', 'code' => '0755'],

        76 => ['name' => '广州', 'code' => '020'],
        693 => ['name' => '广州天河', 'code' => '020'],
        698 => ['name' => '广州越秀', 'code' => '020'],
        696 => ['name' => '广州海珠', 'code' => '020'],
        3436 => ['name' => '广州耀中', 'code' => '020'],

        180 => ['name' => '武汉', 'code' => '027'],
        1545 => ['name' => '武汉武昌', 'code' => '027'],
        1546 => ['name' => '武汉汉口', 'code' => '027'],

        321 => ['name' => '上海', 'code' => '021'],
        2706 => ['name' => '上海徐汇', 'code' => '021'],
        2703 => ['name' => '上海长宁', 'code' => '021'],
        2710 => ['name' => '上海静安', 'code' => '021'],
        2709 => ['name' => '上海普陀', 'code' => '021'],
        3433 => ['name' => '普陀电销', 'code' => '021'],

        233 => ['name' => '南昌', 'code' => '0791'],
        40053 => ['name' => '福州魅力他说', 'code' => '00591'],
        40077 => ['name' => '深圳魅力他说', 'code' => '00755'],

        3401 => ['name' => '合肥', 'code' => '0551'],
        3443 => ['name' => '合肥之心城', 'code' => '0551'],
        3444 => ['name' => '郑州金水', 'code' => '0371'],
        3448 => ['name' => '佛山百花', 'code' => '0757'],
        3449 => ['name' => '珠海光大', 'code' => '0756'],
    ],

    //拨号相关-
    'callcentre_branches' => [
        3443, 3444, 3447, 3448, 3449, 707, 3450, 705, 3434, 3430, 3461, 706, 693,
         3442, 3462, 3463, 6100, 6101, 698, 696, 1546, 3455, 3440, 3457, 3452, 1651,
         3459, 3451, 3458, 6104,
     ],

    //记录用途
    "paid_for_arr" => [
        10 => "定金",
        20 => "尾款",
        30 => "全款",
        70 => "退款",
        80 => "转销",
    ],
    //审核状态
    "audit_status_arr" => [
        0 => "待审核", //系统缺省
        10 => "审核通过",
        20 => "复核通过",
        110 => "待审核",
        120 => "待复核",
        210 => "审核拒绝",
        220 => "复核拒绝",
    ],
    //记录类型
    "paid_type_arr" => [
        10 => "收款",
        20 => "退款",
        30 => "转销",
    ],
    'in_service_arr' => [10 => '未开启', 20 => '开启服务', 30 => '已终止', 40 => '已完结', 50 => '已转销'],
    'is_full_payment_arr' => [10 => '全款', 20 => '非全款', 30 => '免费'],
    'in_contract_arr' => [0 => '系统缺省', 10 => '已签约', 20 => '未签约'],
    "contract_audit_status_arr" => [
        0 => "待审核", //系统缺省
        10 => "审核通过",
        20 => "复核通过",
        110 => "待审核",
        120 => "待复核",
        210 => "审核拒绝",
        220 => "复核拒绝",
    ],
    //业绩审核状态
    "promotion_audit_status_arr" => [
        0 => "待审核", //系统缺省
        10 => "审核通过",
        20 => "复核通过",
        110 => "待审核",
        120 => "待复核",
        210 => "审核拒绝",
        220 => "复核拒绝",
    ],
    //会员服务状态(全局)-table:members
    'member_service_status' => [
        10 => '正常',
        20 => '已撤档',
        // 30 => '已退款',
        40 => '已封存',
    ],
    'order' => [
        'is_specially_approved' => [
            '0' => '否',
            '1' => '是',
        ],
    ],
    //合同类型
    'contract_type' => [
        1 => '纸质合同',
        2 => '电子合同',
    ],

    //证件相关
    "certificates_type" => [
        10 => [
            'key' => 'identification',
            'name' => '身份证',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        20 => [
            'key' => 'marriage',
            'name' => '婚姻状况证明',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        130 => [
            'key' => 'commitment_letter',
            'name' => '会员承诺函',
            'unsubmit_reason_default' => '暂未签订',
        ],
        30 => [
            'key' => 'education',
            'name' => '学历证',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        150 => [
            'key' => 'user_base_info',
            'name' => '会员基本信息',
            'unsubmit_reason_default' => '暂未填写',
        ],
        110 => [
            'key' => 'contract',
            'name' => '合同',
            'unsubmit_reason_default' => '暂未签订',
        ],
        40 => [
            'key' => 'house',
            'name' => '房产证',
            'unsubmit_reason_default' => '客户暂未提供该证件',
            'continue_add' => false,
        ],
        50 => [
            'key' => 'car',
            'name' => '车辆证明',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        60 => [
            'key' => 'work',
            'name' => '工作证',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        70 => [
            'key' => 'self_company',
            'name' => '自有公司证明',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        80 => [
            'key' => 'residence_booklet',
            'name' => '户口本',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        90 => [
            'key' => 'live',
            'name' => '居住证',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        100 => [
            'key' => 'social_security',
            'name' => '社保卡',
            'unsubmit_reason_default' => '客户暂未提供该证件',
        ],
        120 => [
            'key' => 'confirmation_letter',
            'name' => '资料证件确认函',
            'unsubmit_reason_default' => '暂未签订',
        ],
        140 => [
            'key' => 'price_confidentiality_agreement',
            'name' => '价格保密协议',
            'unsubmit_reason_default' => '暂未签订',
        ],
        160 => [
            'key' => 'service_instructions',
            'name' => '服务须知',
            'unsubmit_reason_default' => '暂未签订',
        ],
        170 => [
            'key' => 'vip_first_interview_form',
            'name' => 'VIP首次访谈表',
            'unsubmit_reason_default' => '暂未访谈',
        ],
        180 => [
            'key' => 'vip_value_added_service',
            'name' => 'VIP增值服务',
            'unsubmit_reason_default' => '暂未签订',
        ],
    ],
    "certificates_legal" => [
        "user_base_info",
        "identification",
        "marriage",
        "commitment_letter",
        "contract",
    ],
    "certificates_status" => [
        0 => '未提交',
        1 => '审核通过',
        2 => '待审核',
        3 => '审核拒绝',
        11 => '待提交',
    ],
    "certificates_submitted" => [
        1 => '有提交',
        2 => '未提交',
    ],
    "certificates_validated" => [
        0 => '待审核',
        1 => '审核通过',
        2 => '审核拒绝',
        3 => '审核通过并锁定',
    ],
    "certificates_complete_status" => [
        1 => '证件资料收集完毕,已悉数上传',
        2 => '证件资料尚未收集完毕,已部分上传',
    ],
    "certificates_validated_show" => [
        0 => '待审核',
        1 => '审核通过',
        2 => '审核拒绝',
        3 => '审核通过 <i style="color:green" class="fa fa-lock"></i>',
    ],
    "certificate_necessary_included" => [
        1 => '必需证件齐全',
        2 => '必需证件缺失或部分缺失',
        3 => '必需证件已上传待审核',
    ],
    "certificate_action" => [
        1 => '证件上传',
        2 => '证件审核',
    ],
    "certificate_watch_man" => [
        1,
        3254, //陈芳
        48, //马雪菲
    ],
    "certificate_quality_show"=>[
        10 => [
            'name' => '未提交',
            'color' => '#EE9A49',
            //'color' => 'orange',
        ],
        20 => [
            'name' => '待审核',
            'color' => 'blue',
        ],
        30 => [
            'name' => '通过',
            //'color' => 'green',
            'color' => '#00CD00',
        ],
        40 => [
            'name' => '拒绝',
            'color' => 'red',
        ],
        100 => [
            'name' => '无',
            'color' => 'black',
        ],
    ],
    'follow_up_overdue' => [
        '604800' => '7天', //秒
    ],
    'date_application_overdue' => [
        '2592000' => '30天', //秒
    ],
    'customer_album_access_white_list' => [
        '200000009373',
    ],
];
